frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('sameh', '$2y$13$otDYcM82pv1ya8Ql7A3R3O.BICkEQHlKX64idiHOZVHpwvxagC1w2', 'ZmbY_m7wrtmFEctFEg6q73bHvAhj3rYD', 10, 1477483501, 1477483501)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
     //   $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;