frontend/views/site/login.php

SELECT * FROM `User`
---
            <?php $form = ActiveForm::begin(['id' => 'login-form']);?>

<?php
echo $form->field($model, 'username')->label("")->widget(Select2::classname(), [
'data'          => ArrayHelper::map(\app\models\User::find()->all(),
       'username','username'),
'size'          => Select2::LARGE,
'options'       => ['placeholder' => '... حدد إسم المستخدم'],
'pluginOptions' => [
   'allowClear' => true,
],
]);